/*
8. Створіть клас Планета.
Конструктор класу повинен приймати назву та діаметр планети, а також викликати метод класу для підрахунку об'єму планети (припустимо, що планета це сфера).
Також клас повинен мати метод, що виводить в консоль назву планети та її об'єм.
Приклад: ​Планета *** має об'єм ***.​
Створити ще один клас Земля, унаслідуватися від класу Планета, створити для нього екземпляр класу та викликати метод для виведення в консоль.

 */

class Planet {
    constructor(name, diameter) {
        this.name = name;
        this.v=this.calcV(diameter);
    }

    toString() {
        console.log('​Планета ', this.name, ' має об\'єм ',this.v);
    }

    calcV(d) {
        return 1.3333*3.14*Math.pow(d/2,3);
    }
}


class Earth extends Planet{

}

const earth = new Earth('Earth', 6371);
earth.toString();
